[
    {
        "id": 1,
        "title": "Universities Adopt AI-Powered Learning Platforms for Personalized Education",
        "image_url": "https://images.unsplash.com/photo-1501504905252-473c47e087f8",
        "description": "Major universities across the country are implementing artificial intelligence systems to create personalized learning experiences for students, adapting course content based on individual progress and learning styles.",
        "category_id": 3,
        "author": "Pr. Bouchrika",
        "published_date": "2025-10-20"
    },
    {
        "id": 2,
        "title": "Study Reveals Benefits of Bilingual Education in Early Childhood",
        "image_url": "https://images.unsplash.com/photo-1503676260728-1c00da094a0b",
        "description": "New research shows that children enrolled in bilingual education programs demonstrate enhanced cognitive flexibility and problem-solving skills compared to monolingual peers.",
        "category_id": 3,
        "author": "Abdou",
        "published_date": "2025-10-18"
    },
    {
        "id": 3,
        "title": "Government Announces $2 Billion Investment in STEM Education",
        "image_url": "https://images.unsplash.com/photo-1532094349884-543bc11b234d",
        "description": "The Department of Education unveiled a comprehensive funding package aimed at improving science, technology, engineering, and mathematics programs in public schools nationwide.",
        "category_id": 3,
        "author": "BEDDARI",
        "published_date": "2025-10-15"
    },
    {
        "id": 4,
        "title": "Virtual Reality Transforms Medical School Training Programs",
        "image_url": "https://images.unsplash.com/photo-1576091160399-112ba8d25d1d",
        "description": "Medical schools are incorporating virtual reality simulations to provide students with hands-on surgical practice and diagnostic experience in a risk-free environment.",
        "category_id": 3,
        "author": "GDG",
        "published_date": "2025-10-12"
    },
    {
        "id": 5,
        "title": "Remote Learning Options Become Permanent at Major School Districts",
        "image_url": "https://images.unsplash.com/photo-1588072432836-e10032774350",
        "description": "Following the pandemic era, several large school districts have decided to maintain hybrid learning models, offering families continued flexibility in how their children attend classes.",
        "category_id": 3,
        "author": "Forgot who",
        "published_date": "2025-10-10"
    },
    {
        "id": 6,
        "title": "Champions League Final Set for Epic Showdown in Istanbul",
        "image_url": "https://images.unsplash.com/photo-1522778119026-d647f0596c20",
        "description": "Two football giants prepare for the biggest match of the season as anticipation builds for the Champions League final. Experts predict a thrilling encounter between offensive powerhouses.",
        "category_id": 1,
        "author": "Ben Cheikh",
        "published_date": "2025-10-23"
    },
    {
        "id": 7,
        "title": "Tennis Star Announces Retirement After 20-Year Career",
        "image_url": "https://images.unsplash.com/photo-1554068865-24cecd4e34b8",
        "description": "A legendary tennis player with 22 Grand Slam titles has announced retirement, ending one of the most decorated careers in the sport's history.",
        "category_id": 1,
        "author": "Me for sure",
        "published_date": "2025-10-21"
    },
    {
        "id": 8,
        "title": "Marathon Runner Breaks World Record in Berlin",
        "image_url": "https://images.unsplash.com/photo-1552674605-db6ffd4facb5",
        "description": "History was made at the Berlin Marathon as a Kenyan runner shattered the world record, completing the 42.195 km course in an astonishing time.",
        "category_id": 1,
        "author": "Djamel",
        "published_date": "2025-10-17"
    }
]
